cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "warrensbox/tap"
tap "golangci/tap"
tap "Schniz/tap"

# first install stuff thats useful during the rest of the installation
brew "zsh"
brew "vim"
brew "mas"
mas "1Password 7",              id: 1333542190
cask "alfred"
cask "google-chrome"
cask "visual-studio-code"

# gnu-utils
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "grep"

brew "ack"
brew "autojump"
brew "awscli"
brew "bash"
brew "cloc"
brew "curl-openssl"
brew "diff-so-fancy"
brew "docker-clean"
brew "fontconfig"
brew "gcc"
brew "git-lfs"
brew "git"
brew "go"
brew "golangci/tap/golangci-lint"
brew "grc"
brew "jq"
brew "kubernetes-cli"
brew "moreutils"
brew "multimarkdown"
brew "pandoc"
brew "poetry"
brew "protobuf"
brew "pyenv-virtualenv"
brew "pyenv"
brew "python"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rsync"
brew "shellcheck"
brew "tmux"
brew "trash"
brew "tree"
brew "vimpager"
brew "warrensbox/tap/tfswitch"
brew "wget"
brew "zsh-completions"
brew "Schniz/tap/fnm"

# common apps
cask "appcleaner"
cask "bartender"
cask "brave-browser"
cask "dropbox"
cask "spotify"

# quicklook plugins
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"
cask "webpquicklook"

# developer tools
cask "aws-vault"
cask "dash"
cask "docker"
cask "iterm2"
cask "java"
cask "postico"
cask "postman"
cask "sourcetree"
cask "sublime-text"
cask "tunnelblick"
cask "xquartz"

mas "Affinity Designer",        id: 824171161
mas "Affinity Photo",           id: 824183456
mas "DaisyDisk",                id: 411643860
mas "Keynote",                  id: 409183694
mas "Magnet",                   id: 441258766
mas "Numbers",                  id: 409203825
mas "Pages",                    id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PDF Expert",               id: 1055273043
mas "Slack",                    id: 803453959
mas "SnippetsLab",              id: 1006087419
mas "The Unarchiver",           id: 425424353
