cask_args appdir: "/Applications"
tap "warrensbox/tap"
tap "golangci/tap"
tap "mongodb/brew"

# first install stuff thats useful during the rest of the installation
brew "zsh"
brew "starship"
brew "vim"
brew "mas"
cask "alfred"
cask "visual-studio-code"

# gnu-utils
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "grep"

brew "autojump"
brew "bash"
brew "cfssl"
brew "curl"
brew "diff-so-fancy"
brew "fontconfig"
brew "gcc"
brew "git-lfs"
brew "git"
brew "go"
brew "golangci/tap/golangci-lint"
brew "grc"
brew "eza"
brew "fd"
brew "bat"
brew "jq"
brew "kubernetes-cli"
brew "poetry"
brew "pyenv-virtualenv"
brew "asdf"
brew "pipx"
brew "python"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "tmux"
brew "tldr"
brew "trash"
brew "tree"
brew "vimpager"
brew "warrensbox/tap/tfswitch"
brew "wget"
brew "zsh-completions"
brew "graphviz"
brew "k9s"
brew "kubectx"
brew "mongodb/brew/mongodb-community@4.4"
brew "openjdk@11"
brew "sqlfluff"
brew "yq"

# common apps
cask "appcleaner"
cask "bartender"
cask "spotify"

# quicklook plugins
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"
cask "webpquicklook"

# developer tools
cask "dash"
cask "docker"
cask "iterm2"
cask "sourcetree"

mas "Affinity Designer 2",        id: 1616831348
mas "Affinity Photo 2",           id: 1616822987 
mas "DaisyDisk",                id: 411643860
mas "Magnet",                   id: 441258766
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PDF Expert",               id: 1055273043
mas "Slack",                    id: 803453959
mas "SnippetsLab",              id: 1006087419
mas "The Unarchiver",           id: 425424353
